app/views/tops_forms/tops_form.html.erb

SELECT "tops_qualifiers".* FROM "tops_qualifiers" WHERE "tops_qualifiers"."id" = ? LIMIT 1  [["id", :qualifier_type_id]]
---
    <%# @qualifiers = TopsQualifier.find(:all q.qualifier_type_id) %>
    <% @qualifiers = TopsQualifier.find(:all, :conditions => { :type_id => q.qualifier_type_id}) %>