app/views/tops_questions/index.html.erb

    <% if(tops_question.qualifier_type_id != nil) %>
      <% @qualifier = TopsQualifier.find(:all, :conditions => { :type_id => tops_question.qualifier_type_id, :value_id => 2}) %>
---
SELECT "tops_qualifiers".* FROM "tops_qualifiers" WHERE "tops_qualifiers"."qualifier_type_id" = 1 AND "tops_qualifiers"."value_id" = 2