app/controllers/child_dailies_controller.rb

  def index
    @child_dailies = ChildDaily.all
---
SELECT "child_dailies".* FROM "child_dailies"

  def indexnames
    @child_dailies = ChildDaily.all
---
SELECT "child_dailies".* FROM "child_dailies"

  def show
    @child_daily = ChildDaily.find(params[:id])
---
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @child_daily = ChildDaily.find(params[:id])
---
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", "11"]]

  def create
    @child_daily = ChildDaily.new(params[:child_daily])

    #if(@child_daily.id != nil)

      respond_to do |format|
        if @child_daily.save
---
INSERT INTO "child_dailies" ("cb1", "cb2", "cb3", "child_id", "created_at", "date", "individual_message", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @child_daily = ChildDaily.find(params[:id])
    #@child_daily.attributes = params[:tops_form]
    #@child_daily.tops_form.update_attributes(params[:id])
    respond_to do |format|
      if @child_daily.update_attributes(params[:child_daily])
---
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "child_dailies" SET "child_id" = 2, "individual_message" = 'Wow this is working, kinda.', "cb1" = 'f', "cb2" = 'f', "cb3" = 'f', "date" = '2012-05-09 00:00:00.000000', "updated_at" = '2012-05-11 03:41:40.421875' WHERE "child_dailies"."id" = 46

  def destroy
    @child_daily = ChildDaily.find(params[:id])
    @child_daily.destroy
---
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "child_dailies" WHERE "child_dailies"."id" = ?  [["id", 5]]

  def roll_call
    params[:attendance].each do |i, values|
      c = ChildDaily.create(values)
---
INSERT INTO "child_dailies" ("cb1", "cb2", "cb3", "child_id", "created_at", "date", "individual_message", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def tops_report
    @child_daily = ChildDaily.find(params[:id])
    @tops_forms = TopsForm.find(:all, @child_daily.child_id)
---
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", 3]]