app/controllers/daily_notes_controller.rb

SELECT "daily_notes".* FROM "daily_notes"
---
  def index
    @daily_notes = DailyNote.all

SELECT "daily_notes".* FROM "daily_notes" WHERE "daily_notes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @daily_note = DailyNote.find(params[:id])

INSERT INTO "daily_notes" ("created_at", "date", "note", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @daily_note = DailyNote.new(params[:daily_note])

    respond_to do |format|
      if @daily_note.save