app/controllers/email_messages_controller.rb

SELECT "email_messages".* FROM "email_messages"
---
  def index
    @email_messages = EmailMessage.all

SELECT "email_messages".* FROM "email_messages" WHERE "email_messages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @email_message = EmailMessage.find(params[:id])

SELECT "email_messages".* FROM "email_messages" WHERE "email_messages"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @email_message = EmailMessage.find(params[:id])

INSERT INTO "email_messages" ("child_daily_id", "child_id", "created_at", "daily_note_id", "date", "sent_time", "to_address", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @email_message = EmailMessage.new(params[:email_message])

    respond_to do |format|
      if @email_message.save

SELECT "email_messages".* FROM "email_messages" WHERE "email_messages"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "email_messages" SET "child_id" = 3, "daily_note_id" = 1, "child_daily_id" = 1, "to_address" = 'wherever@somewhere.com', "date" = '2012-05-11 04:35:00.000000', "sent_time" = '9999-12-31 23:59:00.000000', "updated_at" = '2012-05-11 04:35:31.625000' WHERE "email_messages"."id" = 2
---
  def update
    @email_message = EmailMessage.find(params[:id])

    respond_to do |format|
      if @email_message.update_attributes(params[:email_message])

SELECT "email_messages".* FROM "email_messages" WHERE "email_messages"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", 46]]
SELECT "daily_notes".* FROM "daily_notes" WHERE "daily_notes"."id" = ? LIMIT 1  [["id", 4]]
---
  def preview_email
    @email_message = EmailMessage.find(params[:id])
    @child = Child.find(@email_message.child_id)
    @child_daily = ChildDaily.find(@email_message.child_daily_id)
    @daily_note = DailyNote.find(@email_message.daily_note_id)

SELECT "child_dailies".* FROM "child_dailies" WHERE (date>'2012-05-02')
SELECT "daily_notes".* FROM "daily_notes" WHERE (date>'2012-05-02')
INSERT INTO "email_messages" ("child_daily_id", "child_id", "created_at", "daily_note_id", "date", "sent_time", "to_address", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def generate_emails
    email_parts = Hash.new()
    email_parts["child_id"] = 2
    UserMailer.child_daily_email(email_parts).deliver
    emails = Hash.new()
    i = 0
    @child_daily = ChildDaily.where("date>?", Date.yesterday)
    @daily_notes = DailyNote.where("date>?", Date.yesterday)
    @child_daily.each do |daily|
      emails[i]["child_id"] = {"child_id" => daily.child_id}
      emails[i]["child_daily_id"] = {"child_daily_id" => daily.id}
      @daily_notes.each do |daily_note|
        emails[i]["daily_note_id"] = {"daily_note_id" => daily_note.id}
      end
      i = i + 1
    end

    emails.each do |i, values|
      c = EmailMessage.create(values)