app/controllers/tops_questions_controller.rb

SELECT "tops_questions".* FROM "tops_questions"
---
  def index
    @tops_questions = TopsQuestion.all

SELECT "tops_questions".* FROM "tops_questions" WHERE "tops_questions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tops_question = TopsQuestion.find(params[:id])

SELECT "tops_questions".* FROM "tops_questions" WHERE "tops_questions"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @tops_question = TopsQuestion.find(params[:id])

INSERT INTO "tops_questions" ("created_at", "description", "qualifier_type_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 May 2012 03:32:43 UTC +00:00], ["description", "attended during opening circle"], ["qualifier_type_id", nil], ["updated_at", Sun, 13 May 2012 03:32:43 UTC +00:00]]
---
  def create
    @tops_question = TopsQuestion.new(params[:tops_question])

    respond_to do |format|
      if @tops_question.save

SELECT "tops_questions".* FROM "tops_questions" WHERE "tops_questions"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "tops_questions" SET "qualifier_type_id" = 2, "updated_at" = '2012-05-13 03:41:02.500000' WHERE "tops_questions"."id" = 2
---
  def update
    @tops_question = TopsQuestion.find(params[:id])

    respond_to do |format|
      if @tops_question.update_attributes(params[:tops_question])