app/controllers/tops_forms_controller.rb

SELECT "tops_forms".* FROM "tops_forms"
---
  def index
    @tops_forms = TopsForm.all

SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tops_form = TopsForm.find(params[:id])

SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @tops_form = TopsForm.find(params[:id])

INSERT INTO "tops_forms" ("checked", "child_daily_id", "created_at", "note", "qualifier_value_id", "tops_question_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tops_form = TopsForm.new(params[:tops_form])

    respond_to do |format|
      if @tops_form.save

SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tops_forms" SET "checked" = 'f', "updated_at" = '2012-05-20 04:22:08.250000' WHERE "tops_forms"."id" = 1
---
  def update
    @tops_form = TopsForm.find(params[:id])

    respond_to do |format|
      if @tops_form.update_attributes(params[:tops_form])

SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", 6]]
SELECT "tops_questions".* FROM "tops_questions"
SELECT "tops_qualifiers".* FROM "tops_qualifiers"
---
  def tops_form
    @tops_form = TopsForm.find(params[:id])
    #@questions = TopsQuestion.find(@tops_form.tops_question_id)
    #@child_dailies = ChildDailies.all
    @child_daily = ChildDaily.find(@tops_form.child_daily_id)
    @child = Child.find(@child_daily.child_id)
    @questions = TopsQuestion.all
    @qualifiers = TopsQualifier.all

SELECT "tops_forms".* FROM "tops_forms" WHERE "tops_forms"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "child_dailies".* FROM "child_dailies" WHERE "child_dailies"."id" = ? LIMIT 1  [["id", 6]]
SELECT "tops_questions".* FROM "tops_questions"
SELECT "tops_qualifiers".* FROM "tops_qualifiers"
---
  def tops_form2
    @tops_form = TopsForm.find(params[:id])
    #@questions = TopsQuestion.find(@tops_form.tops_question_id)
    #@child_dailies = ChildDailies.all
    @child_daily = ChildDaily.find(@tops_form.child_daily_id)
    @child = Child.find(@child_daily.child_id)
    @questions = TopsQuestion.all
    @qualifiers = TopsQualifier.all