app/controllers/tops_qualifiers_controller.rb

SELECT "tops_qualifiers".* FROM "tops_qualifiers"
---
  def index
    @tops_qualifiers = TopsQualifier.all

SELECT "tops_qualifiers".* FROM "tops_qualifiers" WHERE "tops_qualifiers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tops_qualifier = TopsQualifier.find(params[:id])

INSERT INTO "tops_qualifiers" ("created_at", "type_id", "updated_at", "value_id", "value_name") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 May 2012 03:00:23 UTC +00:00], ["type_id", 0], ["updated_at", Sun, 13 May 2012 03:00:23 UTC +00:00], ["value_id", 0], ["value_name", ""]]
---
  def create
    @tops_qualifier = TopsQualifier.new(params[:tops_qualifier])

    respond_to do |format|
      if @tops_qualifier.save